#สร้างโปรแกรมคำนวณอายุของจากปีเกิด (พ.ศ.) ของพนักงานโรงงานแห่งหนึ่ง 
#โดยป้อนชื่อและปีเกิดทางแป้นพิมพ์ ทั้งนี้โปรแกรมจะหยุดทำงานก็ต่อเมื่อป้อนชื่อพนักงาน เป็น SAU ก็จะหยุดทำงาน

print('-----------------------------------')
print('โปรแกรมคำนวณอายุของพนักงานโรงงาน')
print('-----------------------------------')

while True:
    name = input('ป้อนชื่อพนักงาน : ')
    if name == 'SAU':
        break
    year = int(input('ป้อนปีเกิด (พ.ศ.) : '))
    age = 2567 - year
    print('คุณ',name,'มีอายุ',age,'ปี')
    print('--------------------')
